micropython/micropython/ports/espressif/boards/targett_module_clip_wroom/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

// Essentially the same as the Saola board but without the neopixel

#define MICROPY_HW_BOARD_NAME       "Targett Module Clip w/Wroom"
#define MICROPY_HW_MCU_NAME         "ESP32S2"

// #define MICROPY_HW_NEOPIXEL (&pin_GPIO18)
